app/controllers/songs_controller.rb

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @song = Song.find_by(id: params[:id])

    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "songs" SET "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["artist_id", 5], ["updated_at", "2017-06-18 17:18:48.127449"], ["id", 1]]
---
  def update
    @song = Song.find(params[:id])

    @song.update(song_params)